export const dictionary = {
  "Array - អារេ": [
    "បណ្តុំទិន្នន័យដែលមានទម្រង់ជាជួរមានដើមហើយចុង។ វត្ថុទាំងអស់នៅក្នុងអារេមានលំដាប់ថ្នាក់ដែលយើងអាចហៅវាបាន។ ឧទាហរណ៍៖ ដើម្បីហៅវត្ថុទីមួយនៅក្នុងអារេយើងសរសេរ​ `array[0]`។"
  ],
  "Argument - អាគុយម៉ង់": [
    "ជាទិន្នន័យឬតម្លៃដែលបញ្ជូលក្នុងអនុគមន៍ដើម្បីធ្វើការគណនា។ ឧទាហរណ៍៖ អនុគមន៍ `function add(x, y) {return x + y}` ត្រូវការអាគុយម៉ង់ x និង y ដើម្បីគណនារកចម្លើយ។"
  ],
  "Binary - គោលពីរ": [
    "ប្រព័ន្ធរាប់លេខដែលប្រើលេខ 0 និងលេខ 1 ប្រើប្រាស់ដោយកុំព្យូទ័រសម្រាប់មុខងារគ្រប់យ៉ាង។"
  ],
  "Branch - សាខា": [
    "សំដៅទៅលើការបែកចេញជាសាខាផ្សេងគ្នាក្នុងប្រព័ន្ធគ្រប់គ្រងកំណែកូដ​ (ដូចជាប្រព័ន្ធ git ជាដើម)។",
    "ជម្រើសផ្លូវដែលកូដអាចប្រតិបត្តិតទៀតបាន។"
  ],
  "Break - បញ្ជប់": [
    "ជាទូទៅពាក្យនេះប្រើដើម្បីបញ្ជប់ប្រតិបត្តិ loop។"
  ],
  "Code - កូដ": [
    "ភាសាកូដសម្រាប់យកទៅសរសេរបង្កើតប្រព័ន្ធកម្មវិធីកុំព្យូទ័រ។ ឧទាហរណ៍៖ ភាសា C, Java, PHP។ ល។",
  ],
  "Conditional - តាមលក្ខខណ្ឌ": [
    "ការដាក់លក្ខខណ្ឌ។",
    "កូដដែលប្រតិបត្តិនៅពេលកម្មវិធីត្រូវលក្ខខណ្ឌដែលបានកំណត់។"
  ],
  "Decode - ឌីកូដ": [
    "ដោះស្រាយកូដឬពាក្យសម្ងាត់ដែលបានឆ្លងកាត់ការអ៊ិនកូដ (encode)។",
    "ការបម្លែងទម្រង់អក្សរសម្ងាត់ឲ្យទៅជាទម្រង់ដើមវិញ។"
  ],
  "Domain - ឈ្មោះរឺអាស័យដ្ឋានវឹបសាយ": [
    "អាស័យដ្ឋានរបស់គេហៈទំព័រ។ ឧទាហរណ៍៖ google.com",
  ],
  "E-banking - ធនាគារអេឡិចត្រូនិច": [
    "​ការទូទាត់ប្រតិបត្តិការធានាគារផ្សេងៗលើប្រព័ន្ទអ៊ីនធឺណែត។ ឧទាហរណ៍៖ ពេលអ្នកបង់ប្រាក់តាមប្រព័ន្ធបាគង។"
  ],
  "Encode - អ៊ិនកូដ": [
    "​បម្លែងទម្រង់អក្សរទៅជាទម្រង់សម្ងាត់ដែលត្រូវការពាក្យសម្ងាត់ឬរូបមន្តណាមួយដើម្បីឌីកូដ (decode) ​ឬបម្លែងមកទម្រង់ដើមវិញ។"
  ],
  "Environment - បរិស្ថាន": [
    "បរិស្ថានដែលកូដស្ថិននៅក្នុង។ ឧទាហរណ៍៖ បរិស្ថានសម្រាប់តេស្ត បរិស្ថានផ្លូវការ។"
  ],
  "Float - លេខទស្សភាគ": [
    "លេខមានក្បៀសអាចជាលេខមានតម្លៃតូចជាងសូន្យ ធំជាងសូន្យ ឬស្មើសូន្យ។ ឧទាហរណ៍៖ -2.10, -103.3, 0, 1.02, 2.3, 35.6, 46.003។​ ល។"
  ],
  "Integer - លេខគត់": [
    "លេខគត់មិនមានក្បៀសអាចជាលេខមានតម្លៃតូចជាងសូន្យ ធំជាងសូន្យ ឬស្មើសូន្យ។ ឧទាហរណ៍៖ -2, -1, 0, 1, 2, 3, 4។ ល។"
  ],
  "IP address - អាស័យដ្ឋានអាយភី": [
    "លេខសំគាល់ពិសេសសម្រាប់ឧបករណ៍អេឡិចត្រូនិកទាំងឡាយដែលអាចភ្ជាប់អ៊ីនធឺណិតបាន។ ឧទាហរណ៍៖ 192.168.0.1។"
  ],
  "Network - បណ្ដាញ": [
    "ប្រព័ន្ធភ្ជាប់ឧបករណ៍ផ្សេងៗដែលមានទំនាក់ទំនងជាមួយគ្នា។ ឧទាហរណ៍៖ បណ្តាញអ៊ីនធឺណិត។"
  ],
  "Operating system - ប្រព័ន្ធប្រតិបត្តិការ": [
    "ប្រព័ន្ធប្រតិបត្តិការ សរសេរកាត់ថា OS ជាប្រព័ន្ធកុំព្យូទ័រដែលសម្រួលទៅដល់ការប្រើប្រាស់កុំព្យូទ័រដើម្បីបំពេញមុខងារផ្សេងៗ។ ឧទាហរណ៍៖​ Windows, MacOS, Android។ ល។"
  ],
  "Type - ប្រភេទ": [
    "នៅក្នុងការសរសេរកូដ ទិន្នន័យទាំងអស់មានប្រភេទ​។ ឧទាហរណ៍៖ ប្រភេទអក្សរ​ (string), ប្រភេទលេខ​ (integer)។ ល។"
  ],
  "User interface - ប្រព័ន្ធអន្តរកម្មអ្នកប្រើប្រាស់": [
    "សរសេរកាត់ថា​ UI វាជារូបរាងនិងទម្រង់របស់កម្មវិធីកុំព្យូទ័រដែលអ្នកប្រើប្រាស់ធ្វើអន្តរកម្មផ្សេងៗដូចជាការចុចនិងសរសេរ។​ ឧទាហរណ៍៖ ប៊ូតុងនៅលើគេហទំព័រ។"
  ],
  "User experience - បទពិសោធន៍អ្នកប្រើប្រាស់": [
    "សរសេរកាត់ថា​ UX វាជាបទពិសោធន៍របស់អ្នកប្រើប្រាស់កម្មវិធីកុំព្យូទ័រផ្សេងៗ។ ឧទាហរណ៍៖ នៅពេលអ្នកប្រើប្រាស់ចង់ធ្វើសកម្មភាពអ្វីមួយ គាត់ត្រូវឆ្លងកាត់ជំហានអ្វីខ្លះ។"
  ],
  "Variable - អថេរ": [
    "ពាក្យឬតួអក្សរសម្រាប់សម្គាល់ឲ្យផ្នែកមួយនៃ memory ដែលយើងអាចហៅវាមកពិនិត្យមើលទិន្នន័យឬកែប្រែវាបាន។ ឧទាហរណ៍៖ x = 1។"
  ],
  "Source code - ប្រភពកូដ": [
    "ជាប្រភពរបស់កូដដែលកុំព្យូទ័រត្រូវការដើម្បីដំឡើងកម្មវិធីឬធ្វើឲ្យកម្មវិធីដំណើរការ។",
    "កូដដែលមនុស្សអាចអានបាននិងកែប្រែបានឬកូដដែលមិនទាន់បានធ្វើការបំលែងទៅជាទម្រង់កូដដែលកុំព្យូទ័រត្រូវការដើម្បីដំណើរការ។"
  ],
  "Compiled code - កូដបំលែង": [
    "កូដដែលត្រូវបានបំលែងពីទម្រង់ដើមដែលមនុស្សអាចអាននិងកែប្រែបានទៅជាកូដសម្រាប់កុំព្យូទ័រដំណើរការ។"
  ],
  "Machine code - កូដម៉ាស៊ីន": [
    "កូដដែលមានទម្រង់ប្រព័ន្ធគោលពីរ (0 និង 1) ដែលខួរក្បាលរបស់កុំព្យូទ័រ (CPU) អាចប្រើប្រាស់បានដើម្បីបំពេញមុខងារផ្សេងៗ។"
  ],
  "Character - តួអក្សរ": [
    "តួអក្សរមួយតួ។ ឧទាហរណ៍៖ 'A', 'b', 'C', 'd', '0', 'ក', 'ខ'។"
  ],
  "Boolean - ប៊ូលីន": [
    "ភាពពិតឬមិនពិត។"
  ],
  "Comment - កំណត់ចំណាំ": [
    "កំណត់ចំណាំក្នុងកូដដែលកុំព្យូទ័រនឹងមិនប្រតិបត្តិ។"
  ],
  "Compiler - ប្រព័ន្ធបំលែង": [
    "ប្រព័ន្ធកម្មវិធីសម្រាប់បំលែងកូដពីទម្រង់ដែលមនុស្សអាចអាននិងកែប្រែបានទៅជាទម្រង់កូដដែលកុំព្យូទ័រអាចប្រើប្រាស់បាន។",
    "ប្រព័ន្ធកម្មវិធីដែលមានតួនាទីបំលែងប្រភពកូដ (source code) ទៅជាកូដម៉ាស៊ីន (machine code) សម្រាប់កុំព្យូទ័រប្រតិបត្តិតាម។",
  ],
  "Executable file - ហ្វាល់អាចប្រតិបត្តិបាន": [
    // "ហ្វាល់ដែលអ្នកប្រើប្រាស់កំុំព្យូទ័រអាចបើកបានដំណើរការលើកុំព្យូទ័របាន។ ឧទាហរណ៍៖ 'notepad.exe'"
  ],
  "Extraction - ការបន្លាយ": [
    "ការបន្លាយហ្វាល់ឬឯកសារឲ្យវាមានទំហំនិងទម្រង់ដូចដើម។ ឧទាហរណ៍៖ ពេលអ្នក extract ហ្វាល់ប្រភេទ zip។"
  ],
  "Web browser - កម្មវិធីរុករកបណ្តាញអ៊ីនធឺណិត": [
    "កម្មវិធីសម្រាប់បើកគេហៈទំព័រនិងឯកសារផ្សេងៗដែលមាននៅលើបណ្តាញអ៊ីនធឺណិត។ ឧទាហរណ៍៖ Chrome, Firefox, Opera។ ល។"
  ],
  "Syntax - វាក្យសម្ពន្ធ": [
    "ជាក្បួនសម្រាប់សរសេរកូដដើម្បីឲ្យមានដំណើរការត្រឹមត្រូវ ប្រៀបបានទៅនឹងវេយ្យាករណ៍ក្នុងភាសាខ្មែរ។ ឧទាហរណ៍៖​ នៅក្នុងភាសា C យើងសរសេរ `printf('hello')` ប៉ុន្តែក្នុងភាសា Python យើងសរសេរ `print 'hello'`"
  ],
  // "Parameter - អថេរ": [
  //   "សម្រាប់អត្ថន័យអាយធីជាអថេរពិសេសមួយដូច Variable ដែរតែគេប្រើវាក្នុងអនុគមន៍(Function)។"
  // ],
  // "Loop - រង្វិលជុំ": [
  //   "សម្រាប់អត្ថន័យអាយធី គេសម្ដៅដល់ដំណើរវិលជុំដដែលៗត្រឡប់ចុះត្រឡប់ឡើងក្នុងរការអានកូដរបស់កុំព្យូទ័រ។"
  // ],
  // "While loop - វិលជុំ": [
  //   "សម្រាប់អត្ថន័យអាយធី គេសម្ដៅដល់ដំណើរការរវង្វិលជុំតែការប្រើប្រាស់ស្រដៀងគ្នានិង Loop ដ៏ទៃទៀតដែរ។"
  // ],
  // "For loop - វិលជុំ": [
  //   "សម្រាប់អត្ថន័យអាយធី គេសម្ដៅដល់ដំណើរការរវង្វិលជុំតែការប្រើប្រាស់ស្រដៀងគ្នានិង Loop ដ៏ទៃទៀតដែរ។"
  // ],
  // "Console - ខនសូល": [
  //   "ជាកន្លែងសម្រាប់ អ្នកអាយធីបញ្ជារលើកុំព្យូទ័រជំនួសអោយការប្រើ Mouse ដើម្បីចុច សម្រាប់អ្នកអាជីពអាយធីគេប្រើច្រើន"
  // ],
  // "Pre-processor - ដំណើររត្រៀម": [
  //   "ក្នុងភាសាអាយធី សម្ដៅដល់ប្រព័ន្ធកម្មវិធីដែលធ្វើការគណនាមុននឹងយកទៅសង្វាក់បន្ទាប់ៗ"
  // ],
  // "Package - ប្រព័ន្ធកម្មវិធីជំនួយ": [
  //   "ក្នុងន័យប្រព័ន្ធកម្មវិធី(Software) សម្ដៅដល់កូដកម្មវិធីទាំងឡាយដែលគេសរសេរទុកជាផ្នែកតូចៗរឺធំដើម្បីជួយក្នុងការអភិវឌ្ឍន៏កម្មវិធី"
  // ],
  // "Peripheral - គ្រឿងឧបករណ៍កុំព្យូទ័រ": [
  //   "ក្នុងភាសាបច្ចេកទេសអាយធី គេសម្ដៅដល់ឧបករណ៍ក្នុងរឺក្រៅរបស់កុំព្យូទ័រ តែមិនរាប់ចូលឧករណ៍ស៊ីជម្រៅខ្លាំងរហូតដល់កន្លែងខួរក្បាលគិតរបស់កុំព្យូទ័រទេ"
  // ],
  // "CPU - ស៊ីភីយូ": [
  //   "ខួរក្បាលរបស់កុំព្យូទ័រ សូមគត់សំគាល់ផងដែរថាក្នុងមួយ CPU Core ក្នុងពេលតែមួយអាចធ្វើការបានពីររឺហៅថា២ threads ដូចច្នេះបើកុំព្យូទ័រមួយមាន 8 cores(មានខួរក្បាល៨) បានសេចក្ដីថាធ្វើការក្នុងពេលតែមួយមានកម្លាំងគណនា ១៦ threads ឯនោះ។"
  // ],
  // "RAM - រ៉េម": [
  //   "ជាអង្គចងចាំបណ្ដោះអាសន្ន សូមបញ្ជាក់ថាក្នុងប្រព័ន្ធកុំព្យូទ័រការចងចាំមាន២យ៉ាងធំៗគឺមួយកត់ទុកក្នុង hard disk មួយទៀតគឺរ៉េម(RAM) នេះឯងវាមានល្បឿនលឿនតែបញ្ហាត្រង់ពេលដាច់ភ្លើងរឺកុំព្យូទ័ររលត់និងបាត់ការចងចាំ"
  // ],
  // "CPU (Instruction) - កូដសម្រាប់ CPU": [
  //   "សម្ដៅដល់កូដទាំងឡាយដែល CPU អានយល់ ក្នុងភាសាអាយធីកូដដែលអ្នកអភិវឌ្ឃប្រព័ន្ធកម្មវិធីសរសេររួចត្រូវបំលែងរហូតដល់ CPU Instruction នេះឯងទើបកុំព្យូទ័រដឹងថាត្រូវធ្វើការអ្វីរឺគណនាអ្វីដែលមនុស្សចង់បាន។"
  // ],
  // "Return - លទ្ធផល": [
  //   "អត្ថន័យពាក្យនេះបើសម្ដៅដល់កូដ គឺជាលទ្ធផលចុងក្រោយបន្ទាប់កូដគណនារួច"
  // ],
  // "Input - បញ្ចូល": [
  //   "សម្ដៅដល់ការបញ្ចូលទិន្នន័យអោយទៅកុំព្យូទ័រ"
  // ],
  // "Output - បញ្ចេញ": [
  //   "សម្ដៅដល់ការបញ្ចេញទិន្នន័យមកពីកុំព្យូទ័រ"
  // ],
  // "Switch Case - លក្ខខណ្ឌច្រើនករណី": [
  //   "ប្រើក្នុងការសរសេរកូដ Switch Case ជាប្រភេទ `អថេរ` អាចមានតម្លៃច្រើនករណីស្រដៀងពិន្ទុសិស្សម្នាក់បើសិនក្រោម ៥០ធ្លាក់ បើត្រឹម៥០ជាប់ លើស៥០ធម្យម ...។"
  // ],
  // "Initialization - ការកំណត់ដំបូង": [
  //   "ក្នុងអត្ថន័យបច្ចេកទេសអាយធី គេសម្ដៅដល់ការកំណត់ដំបូងនៃប្រព័ន្ធកម្មវិធីរឺកូដ ឧទាហ៍លោកអ្នកបើកកុំព្យូទ័ររឺទូរសព្ទមុនចូលដល់ផ្ទាំង(screen) ដំបូងត្រូវរងចាំមួយភ្លេតនោះជាដំណាក់កាល Initial។"
  // ],
  // "Multidimensional Array - `អារ៉េ`មានធាតុជា`អារ៉េ`": [
  //   "ដំបូងសូមបកស្រាយពាក្យថា`អារ៉េ` សម្ដៅដល់ទិន្នន័យច្រើនធាតុព្រោះគេផ្ដុំធាតុដាក់តំរៀបគ្នាជាជួរ រីឯពាក្យ `Multidimension` ប្រែថាច្រើន សរុបសេចក្ដី `អារ៉េ`មានធាតុជា `អារ៉េ`។"
  // ],
  // "Declaration - ប្រកាស": [
  //   "សម្រាប់សរសេរកូដគេប្រើពាក្យ Declaration គឺការប្រកាសអថេររឺ variable ព្រោះក្នុងកុំព្យូទ័រមិនអាចប្រើ អថេរដោយមិនប្រកាសមុននោះទេ។"
  // ],
  "Function": [],
  "Function Call": [],
  "Function Definition": [],
  "Standard library": [],
  "SDK": [],
  "Argument": [],
  "Return Type": [],
  "Void": [],
  "Algorithm": [],
  "programming": [],
  "serialize": [],
  "deserialize": [],
  "CICD": [],
  "Deploy": [],
  "Mail Server": [],
  "Protocol": [],
  "Cached": [],
  "DNS": [],
  "Cpanel": [],
  "Prototype": [],
  "Buffer": [],
  "Network Socket": [],
  "SQL": [],
  "Command": [],
  "Terminal": [],
  "Route": [],
  "Horizontal Scale": [],
  "Vertical Scaling": [],
  "NOSQL Database": [],
  "Relational Database": [],
  "Database": [],
  "PDF": [],
  "Read File": [],
  "Write File": [],
  "Upload": [],
  "Download": [],
  "UDP Connection": [],
  "TCP Connection": [],
  "Connection Pool": [],
  "Persistence Connection": [],
  "Session": [],
  "JSON": [],
  "JWT Token": [],
  "MessagePack": [],
  "Microservice": [],
  "Monolithic": [],
  "WIFI": [],
  "Access Point (AP)": [],
  "Authorization": [],
  "Authentication": [],
  "Accounting": [],
  "AAA - (Authentication-Authorization-Accounting": [],
  "LDAP": [],
  "WAMP": [],
  "Apache Foundation": [],
  "UUID": [],
  "JavaScript": [],
  "HTML": [],
  "PHP": [],
  "Scala": [],
  "Rust": [],
  "Lua": [],
  "Python": [],
  "ASP": [],
  "Nodejs": [],
  "CSS": [],
  "XML": [],
  "Web Service": [],
  "Web Server": [],
  "HTTP Server": [],
  "Proxy": [],
  "Virtual Host": [],
  "SSL": [],
  "Git": [],
  "Github": [],
  "Gitlab": [],
  "SVN": [],
  "Version Control": [],
  "Byte": [],
  "Bit": [],
  "Lazy load": [],
  "Package Data": [],
  "Firewall": [],
  "DDoS": []


}
