export const dictionary = {
  "Array - អារេ": [
    "បណ្តុំទិន្នន័យដែលមានទម្រង់ជាជួរមានដើមហើយចុង។ វត្ថុទាំងអស់នៅក្នុងអារេមានលំដាប់ថ្នាក់ដែលយើងអាចហៅវាបាន។ ឧទាហរណ៍៖ ដើម្បីហៅវត្ថុទីមួយនៅក្នុងអារេយើងសរសេរ​ `array[0]`"
  ],
  "Binary - គោលពីរ": [
    "ប្រព័ន្ធរាប់លេខដែលប្រើលេខ 0 និងលេខ 1 ប្រើប្រាស់ដោយកំព្យូទ័រសម្រាប់មុខងារគ្រប់យ៉ាង។"
  ],
  "Branch - សាខា": [
    "សំដៅទៅលើការបែកចេញជាសាខាផ្សេងគ្នាក្នុងប្រព័ន្ធគ្រប់គ្រងកំណែកូដ​ (ដូចជាប្រព័ន្ធ git ជាដើម)។",
    "ជម្រើសផ្លូវដែលកូដអាចប្រតិបត្តិតទៀតបាន។"
  ],
  "Break - បញ្ជប់": [
    "ជាទូទៅពាក្យនេះប្រើដើម្បីបញ្ជប់ប្រតិបត្តិ loop។"
  ],
  "Code - កូដ": [
    "ជាភាសាកូដសម្រាប់យកទៅសរសេរបង្កើតប្រព័ន្ធកម្មវិធីរបស់កុំព្យូទ័រ។ ឧទាហរណ៍៖ ភាស C, ភាសា Java, ភាសា PHP ...។",
  ],
  "Conditional - តាមលក្ខខណ្ឌ": [
    "ការដាក់លក្ខខណ្ឌ។",
    "កូដដែលប្រតិបត្តិនៅពេលកម្មវិធីត្រូវលក្ខខណ្ឌដែលបានកំណត់។"
  ],
  "Decode - ឌីកូដ": [
    "ដោះស្រាយកូដឬពាក្យសម្ងាត់ដែលបានឆ្លងកាត់ការអ៊ិនកូដ (encode)។",
    "ការបម្លែងទម្រង់អក្សរសម្ងាត់ឲ្យទៅជាទម្រង់ដើមវិញ។"
  ],
  "Encode - អ៊ិនកូដ": [
    "​បម្លែងទម្រង់អក្សរទៅជាទម្រង់សម្ងាត់ដែលត្រូវការពាក្យសម្ងាត់ឬរូបមន្តណាមួយដើម្បីឌីកូដ (decode) ​ឬបម្លែងមកទម្រង់ដើមវិញ។"
  ],
  "Environment - បរិស្ថាន": [
    "បរិស្ថានដែលកូដស្ថិននៅក្នុង។ ឧទាហរណ៍៖ បរិស្ថានសម្រាប់តេស្ត បរិស្ថានផ្លូវការ។"
  ],
  "Float - លេខទស្សភាគ": [
    "ជាលេខមានក្បៀសអាចជាលេខមានតម្លៃតូចជាងសូន្យ ធំជាងសូន្យ ឬស្មើសូន្យ។ ឧទាហរណ៍៖ -2.10, -103.3, 0, 1.02, 2.3, 35.6, 46.003។​ ល។"
  ],
  "Integer - លេខគត់": [
    "ជាលេខគត់មិនមានក្បៀសអាចជាលេខមានតម្លៃតូចជាងសូន្យ ធំជាងសូន្យ ឬស្មើសូន្យ។ ឧទាហរណ៍៖ -2, -1, 0, 1, 2, 3, 4។ ល។"
  ],
  "OS - ប្រព័ន្ធប្រតិបត្តិការ": [
    "មកពីពាក្យពេញ (Operating System) ជាប្រព័ន្ធដ៏សំខាន់និងចម្បងបំផុតសម្រាប់ដំណើរការលើកុំព្យូទ័រដែលមានមុខងារច្រើនដូចជា ចាត់ចែងដំណើរការតូចៗនៃប្រព័ន្ធផ្សេង។",
    "OS ក៏អាចធ្វើការជាមួយឧបករណ៍កុំព្យូទ័រដោយអ្នកប្រើប្រាស់មិនចាំបាច់យល់ស៊ីជម្រៅដល់ភាពស្មុគស្មាញនៃគ្រឿងខាងក្នុង"
  ],
  "Type - ប្រភេទ": [
    "នៅក្នុងការសរសេរកូដ ទិន្នន័យទាំងអស់មានប្រភេទ​។ ឧទាហរណ៍៖ ប្រភេទអក្សរ​ (string), ប្រភេទលេខ​ (integers)។ ល។"
  ],
  "Variable - អថេរ": [
    "ជាពាក្យឬតួអក្សរសម្រាប់សម្គាល់ឲ្យផ្នែកមួយនៃ memory ដែលយើងអាចហៅវាមកពិនិត្យមើលទិន្នន័យឬកែប្រែវាបាន។"
  ],

}
