export const dictionary = {
  "Array - អារេ": [
    "បណ្តុំទិន្នន័យដែលមានទម្រង់ជាជួរមានដើមហើយចុង។ វត្ថុទាំងអស់នៅក្នុងអារេមានលំដាប់ថ្នាក់ដែលយើងអាចហៅវាបាន។ ឧទាហរណ៍៖ ដើម្បីហៅវត្ថុទីមួយនៅក្នុងអារេយើងសរសេរ​ `array[0]`។"
  ],
  "Binary - គោលពីរ": [
    "ប្រព័ន្ធរាប់លេខដែលប្រើលេខ 0 និងលេខ 1 ប្រើប្រាស់ដោយកុំព្យូទ័រសម្រាប់មុខងារគ្រប់យ៉ាង។"
  ],
  "Branch - សាខា": [
    "សំដៅទៅលើការបែកចេញជាសាខាផ្សេងគ្នាក្នុងប្រព័ន្ធគ្រប់គ្រងកំណែកូដ​ (ដូចជាប្រព័ន្ធ git ជាដើម)។",
    "ជម្រើសផ្លូវដែលកូដអាចប្រតិបត្តិតទៀតបាន។"
  ],
  "Break - បញ្ជប់": [
    "ជាទូទៅពាក្យនេះប្រើដើម្បីបញ្ជប់ប្រតិបត្តិ loop។"
  ],
  "Code - កូដ": [
    "ជាភាសាកូដសម្រាប់យកទៅសរសេរបង្កើតប្រព័ន្ធកម្មវិធីកុំព្យូទ័រ។ ឧទាហរណ៍៖ ភាសា C, Java, PHP។ ល។",
  ],
  "Conditional - តាមលក្ខខណ្ឌ": [
    "ការដាក់លក្ខខណ្ឌ។",
    "កូដដែលប្រតិបត្តិនៅពេលកម្មវិធីត្រូវលក្ខខណ្ឌដែលបានកំណត់។"
  ],
  "Decode - ឌីកូដ": [
    "ដោះស្រាយកូដឬពាក្យសម្ងាត់ដែលបានឆ្លងកាត់ការអ៊ិនកូដ (encode)។",
    "ការបម្លែងទម្រង់អក្សរសម្ងាត់ឲ្យទៅជាទម្រង់ដើមវិញ។"
  ],
  "Domain - ឈ្មោះរឺអាស័យដ្ឋានវឹបសាយ": [
    "អាស័យដ្ឋានរបស់គេហៈទំព័រ។ ឧទាហរណ៍៖ www.budinst.gov.kh",
  ],
  "E-banking - ធនាគារអេឡិចត្រូនិច": [
    "​ការទូទាត់ប្រតិបត្តិការធានាគារផ្សេងៗលើប្រព័ន្ទអ៊ីនធឺណែត។ ឧទាហរណ៍៖ ប្រព័ន្ធបាគង។"
  ],
  "Encode - អ៊ិនកូដ": [
    "​បម្លែងទម្រង់អក្សរទៅជាទម្រង់សម្ងាត់ដែលត្រូវការពាក្យសម្ងាត់ឬរូបមន្តណាមួយដើម្បីឌីកូដ (decode) ​ឬបម្លែងមកទម្រង់ដើមវិញ។"
  ],
  "Environment - បរិស្ថាន": [
    "បរិស្ថានដែលកូដស្ថិននៅក្នុង។ ឧទាហរណ៍៖ បរិស្ថានសម្រាប់តេស្ត បរិស្ថានផ្លូវការ។"
  ],
  "Float - លេខទស្សភាគ": [
    "ជាលេខមានក្បៀសអាចជាលេខមានតម្លៃតូចជាងសូន្យ ធំជាងសូន្យ ឬស្មើសូន្យ។ ឧទាហរណ៍៖ -2.10, -103.3, 0, 1.02, 2.3, 35.6, 46.003។​ ល។"
  ],
  "Integer - លេខគត់": [
    "ជាលេខគត់មិនមានក្បៀសអាចជាលេខមានតម្លៃតូចជាងសូន្យ ធំជាងសូន្យ ឬស្មើសូន្យ។ ឧទាហរណ៍៖ -2, -1, 0, 1, 2, 3, 4។ ល។"
  ],
  "IP Address - អាស័យដ្ឋានអាយភី": [
    "ជាលេខសំគាល់ពិសេសសម្រាប់ឧបករណ៍អេឡិចត្រូនិកទាំងឡាយដែលអាចភ្ជាប់អ៊ីនធឺណិតបាន។ ឧទាហរណ៍៖ 192.168.0.1។"
  ],
  "Network - បណ្ដាញ": [
    "ប្រព័ន្ធភ្ជាប់ឧបករណ៍ផ្សេងៗដែលមានទំនាក់ទំនងជាមួយគ្នា។ ឧទាហរណ៍៖ បណ្តាញអ៊ីនធឺណិត។"
  ],
  "Operating System - ប្រព័ន្ធប្រតិបត្តិការ": [
    "ប្រព័ន្ធប្រតិបត្តិការ សរសេរកាត់ថា OS ជាប្រព័ន្ធកុំព្យូទ័រដែលសម្រួលទៅដល់ការប្រើប្រាស់កុំព្យូទ័រដើម្បីបំពេញមុខងារផ្សេងៗ។ ឧទាហរណ៍៖​ Windows, MacOS, Android។ ល។"
  ],
  "Type - ប្រភេទ": [
    "នៅក្នុងការសរសេរកូដ ទិន្នន័យទាំងអស់មានប្រភេទ​។ ឧទាហរណ៍៖ ប្រភេទអក្សរ​ (string), ប្រភេទលេខ​ (integers)។ ល។"
  ],
  "User Interface - ប្រព័ន្ធអន្តរកម្មអ្នកប្រើប្រាស់": [
    "សរសេរកាត់ថា​ UI វាជារូបរាងនិងទម្រង់របស់កម្មវិធីកុំព្យូទ័រដែលអ្នកប្រើប្រាស់ធ្វើអន្តរកម្មផ្សេងៗដូចជាការចុចនិងសរសេរ។​ ឧទាហរណ៍៖ ប៊ូតុងនៅលើគេហទំព័រ។"
  ],
  "User Experience - បទពិសោធន៍អ្នកប្រើប្រាស់": [
    "សរសេរកាត់ថា​ UX វាជាបទពិសោធន៍របស់អ្នកប្រើប្រាស់កម្មវិធីកុំព្យូទ័រផ្សេងៗ។ ឧទាហរណ៍៖ នៅពេលអ្នកប្រើប្រាស់ចង់ធ្វើសកម្មភាពអ្វីមួយ គាត់ត្រូវឆ្លងកាត់ជំហានអ្វីខ្លះ។"
  ],
  "Variable - អថេរ": [
    "ជាពាក្យឬតួអក្សរសម្រាប់សម្គាល់ឲ្យផ្នែកមួយនៃ memory ដែលយើងអាចហៅវាមកពិនិត្យមើលទិន្នន័យឬកែប្រែវាបាន។ ឧទាហរណ៍៖ x = 1។"
  ],
  "Source code": [],
  "Compile code": [],
  "Machine Code": [],
  "Character": [],
  "Boolean": [],
  "Comment": [],
  "Compiler": [],
  "Executable file": [],
  "Extraction": [],
  "Web browser": [],
  "Syntax": [],
  "Parameter": [],
  "Loop": [],
  "While loop": [],
  "For loop": [],
  "Console": [],
  "Pre-processor": [],
  "Package": [],
  "Peripheral": [],
  "CPU": [],
  "RAM": [],
  "CPU (Instruction)": [],
  "Return": [],
  "Input": [],
  "Output": [],
  "Switch Case": [],
  "Initialization": [],
  "Multidimensional Array": [],
  "Declaration": [],
  "Function": [],
  "Function Call": [],
  "Function Definition": [],
  "Standard library": [],
  "SDK": [],
  "Argument": [],
  "Return Type": [],
  "Void": []
}
